Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateRailWarn Property
 Can't create Railing. Thickness of Rail or Balusters might be too small. If you don't want Balusters, specify "None" for Baluster Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateRailWarn { get; }
Public Shared ReadOnly Property CannotCreateRailWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateRailWarn {
	FailureDefinitionId^ get ();
}
static member CannotCreateRailWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace